#+title: Python 1
#+author: Shaurya Singh

What python version are you running?
#+begin_src bash :results output
python3 --version
#+end_src

#+RESULTS:
: Python 3.9.6

*Note:* I have multiple versions of python, hence why I specify python3. You may just use src_sh{python --version} instead.

Test your editor
#+begin_src python :results output
print("Hello World")
print("Welcome To the Robotics Team")
#+end_src

#+RESULTS:
: Hello World
: Welcome To the Robotics Team

Task1: Simple solution (mine)
#+begin_src python
print('The sum is %.1f' %(float(input('Enter first number: ')) + float(input('Enter second number: ')) + float(input('Enter third number: '))))
#+end_src

Adityas solution. Longer but easier to read:
#+begin_src python
input1 = input("Enter first number: ")
input2 = input("Enter first number: ")
input3 = input("Enter first number: ")
value = float(input1) + float(input2) + float(input3)
print(f"The sum of {input1}, {input2}, and {input3} is {value}")
#+end_src

Arnav's solution (notice his use of error handling)
#+begin_src python
#Code by: Arnav Ambre
# 7/19/21
def getNumber(index):
    while True:
        try:
            x = float(input("Hey broski, enter the " + index + " number: "))
            break
        except ValueError:
            print("Thats not a number! Try again.")
    return x

x = getNumber("first")
y = getNumber("second")
z = getNumber("third")
print("Here is the sum of the numbers:", x + y + z)
#+end_src

Prisha's solution: Note how she used strings instead of floats by accident when trying to find total, giving us the incorrect answer
#+begin_src python
# Prisha
num1 = input("Enter the first number: ")
num2 = input("Enter the second number: ")
num3 = input("Enter the third number: ")
total = num1 + num2 + num3
print("The sum of " + str(num1) + ", " + str(num2) + " and " + str(num3) + " is " + str(total))
#+end_src
